feaser/openblt/Target/Source/ARMCM7_STM32F7/flash.c
      /* sanity check. sector base address should be 32-bit aligned and the size
       * should be a multiple of 32-bits.
       */
      ASSERT_RT(((sectorAddr % sizeof(blt_int32u)) == 0) && 
                ((sectorSize % sizeof(blt_int32u)) == 0));  
      
      /* update result to success for now */
      result = BLT_TRUE;
      /* initialize the pointer to the first word in the sector */
      wordPtr = (blt_int32u volatile const *)sectorAddr;
      /* read sector 32-bits at a time */
      for (wordCnt = 0; wordCnt < (sectorSize/sizeof(blt_int32u)); wordCnt++)
      {
        /* service the watchdog every 256th loop iteration */
        if ((wordCnt % 256) == 0)
        {
          CopService();
        }
        /* word not in the erased state? */
        if (*wordPtr != 0xFFFFFFFFu)
        {
          /* sector not empty, update the result accordingly */
          result = BLT_FALSE;
          /* no point in continuing the sector empty check */
          break;
        }
        /* set pointer to the next word in the sector */
        wordPtr++;
      }
      /* sector index found and checked. no need to continue with another one.*/
      break;
    }
  }  
  /* give the result back to the caller. */
  return result;
} /*** end of FlashEmptyCheckSector ***/


/************************************************************************************//**
** \brief     Erases the flash sectors from first_sector up until last_sector.
** \param     first_sector First flash sector number.
** \param     last_sector  Last flash sector number.
** \return    BLT_TRUE if successful, BLT_FALSE otherwise.
**
****************************************************************************************/
static blt_bool FlashEraseSectors(blt_int8u first_sector, blt_int8u last_sector)
{
  blt_bool result = BLT_TRUE;
  blt_int8u sectorIdx;
  FLASH_EraseInitTypeDef eraseInitStruct;
  blt_int32u eraseSectorError = 0;

  /* validate the sector numbers */
  if (first_sector > last_sector)
  {
    result = BLT_FALSE;
  }
  if ((first_sector < flashLayout[0].sector_num) || \
      (last_sector > flashLayout[FLASH_TOTAL_SECTORS-1].sector_num))
  {
    result = BLT_FALSE;
  }
  
  /* this flash driver currently supports single bank mode. report an error if it is
   * configured in dual bank mode. otherwise a tricky to debug hard fault might happen.
   */
  if (FlashIsSingleBankMode() == BLT_FALSE)
  {
    /* cannot perform flash operation, because it is configured in dual bank mode. */
    result = BLT_FALSE;
  }
  
  /* only move forward with the erase operation if all is okay so far */
  if (result == BLT_TRUE)
  {
    /* intialize the sector erase info structure */
    eraseInitStruct.TypeErase = FLASH_TYPEERASE_SECTORS;
    eraseInitStruct.VoltageRange = FLASH_VOLTAGE_RANGE_3;
    eraseInitStruct.NbSectors = 1;

    /* unlock the flash array */
    HAL_FLASH_Unlock();

    /* erase all sectors one by one */
    for (sectorIdx=first_sector; sectorIdx<= last_sector; sectorIdx++)
    {
      /* no need to erase the sector if it is already empty */
      if (FlashEmptyCheckSector(sectorIdx) == BLT_FALSE)
      {
        /* keep the watchdog happy */
        CopService();
        /* set the sector to erase */
        eraseInitStruct.Sector = sectorIdx;
        /* submit the sector erase request */
        if(HAL_FLASHEx_Erase(&eraseInitStruct, (uint32_t *)&eraseSectorError) != HAL_OK)
        {
          /* could not perform erase operation */
          result = BLT_FALSE;
          /* error detected so don't bother continuing with the loop */
          break;
        }
      }
    }

    /* lock the flash array again */
    HAL_FLASH_Lock();
  }

  /* give the result back to the caller */
  return result;
} /*** end of FlashEraseSectors ***/


/************************************************************************************//**
** \brief     Determines the flash sector the address is in.
** \param     address Address in the flash sector.
** \return    Flash sector number or FLASH_INVALID_SECTOR.
**
****************************************************************************************/
static blt_int8u FlashGetSector(blt_addr address)
{
  blt_int8u result = FLASH_INVALID_SECTOR;
  blt_int8u sectorIdx;

  /* search through the sectors to find the right one */
  for (sectorIdx = 0; sectorIdx < FLASH_TOTAL_SECTORS; sectorIdx++)
  {
    /* keep the watchdog happy */
    CopService();
    /* is the address in this sector? */
    if ((address >= flashLayout[sectorIdx].sector_start) && \
        (address < (flashLayout[sectorIdx].sector_start + \
                    flashLayout[sectorIdx].sector_size)))
    {
      /* found the sector we are looking for so store it */
      result = flashLayout[sectorIdx].sector_num;
      /* all done so no need to continue looping */
      break;
    }
  }
  /* give the result back to the caller */
  return result;
} /*** end of FlashGetSector ***/


/************************************************************************************//**
** \brief     Determines the flash is configured in single bank mode, which is required
**            by this flash driver.
** \return    BLT_TRUE if the flash is in single bank mode, BLT_FALSE otherwise.
**
****************************************************************************************/
static blt_bool FlashIsSingleBankMode(void)
{
  blt_bool result = BLT_TRUE;

  /* dual bank mode is only available on certain STM32F7 variants. for these variants,
   * macro FLASH_OPTCR_nDBANK is defined in the HAL.
   */
  #if defined (FLASH_OPTCR_nDBANK)
  /* check if the flash is NOT in single bank mode. */
  if ((FLASH->OPTCR & FLASH_OPTCR_nDBANK) == 0)
  {
    /* update the result to indicate that the flash is not in single bank mode. */
    result = BLT_FALSE;
  }
  #endif /* FLASH_OPTCR_nDBANK */

  /* give the result back to the caller. */
  return result;
} /*** end of FlashIsSingleBankMode ***/


/*********************************** end of flash.c ************************************/
